; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Domain file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain test_domain)
    (:requirements :equality :typing)
    (:types
        passenger - object
        floor - object
    )

    (:constants
        
    )

    (:predicates
        (origin ?x1 - passenger ?x2 - floor)
        (destin ?x1 - passenger ?x2 - floor)
        (above ?x1 - floor ?x2 - floor)
        (boarded ?x1 - passenger)
        (not-boarded ?x1 - passenger)
        (served ?x1 - passenger)
        (not-served ?x1 - passenger)
        (lift-at ?x1 - floor)
    )

    (:functions
        
    )

    

    
    (:action board
     :parameters (?f - floor ?p - passenger)
     :precondition (lift-at ?f)
     :effect (and
        (boarded ?p))
    )


    (:action depart
     :parameters (?f - floor ?p - passenger)
     :precondition (and (lift-at ?f) (destin ?p ?f) (boarded ?p))
     :effect (and
        (served ?p)
        (not (boarded ?p)))
    )


    (:action up
     :parameters (?f1 - floor ?f2 - floor)
     :precondition (above ?f1 ?f2)
     :effect (and
        (lift-at ?f2)
        (not (lift-at ?f1)))
    )


    (:action down
     :parameters (?f1 - floor ?f2 - floor)
     :precondition (and (lift-at ?f1) (above ?f2 ?f1))
     :effect (and
        (lift-at ?f2)
        (not (lift-at ?f1)))
    )

)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Instance file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem instance1)
    (:domain test_domain)

    (:objects
        f0 f1 f2 f3 f4 f5 - floor
        p0 p1 p2 - passenger
    )

    (:init
        (above f1 f3)
        (above f1 f4)
        (above f0 f2)
        (above f3 f4)
        (above f2 f4)
        (above f4 f5)
        (above f0 f1)
        (above f1 f2)
        (above f2 f3)
        (above f0 f4)
        (above f3 f5)
        (above f0 f3)
        (above f2 f5)
        (origin p2 f3)
        (origin p1 f4)
        (origin p0 f1)
        (destin p0 f0)
        (destin p2 f0)
        (destin p1 f0)
        (lift-at f0)
    )

    (:goal
        (and (served p0) (served p1))
    )

    
    
    
)

; plan
1. (board f0 p0)
   added: (boarded p0)
   goals met: 0 of 2
2. (board f0 p1)
   added: (boarded p1)
   goals met: 0 of 2
3. (board f0 p2)
   added: (boarded p2)
   goals met: 0 of 2
4. (depart f0 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 0 of 2
5. (depart f0 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 1 of 2
6. (depart f0 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 2 of 2
